Revit 2027 API
CutMarkType.CutMarkSymbol Property
 The symbol type of the cut mark.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CutMarkSymbol CutMarkSymbol { get; set; }
Public Property CutMarkSymbol As CutMarkSymbol
	Get
	Set
public:
property CutMarkSymbol CutMarkSymbol {
	CutMarkSymbol get ();
	void set (CutMarkSymbol value);
}
member CutMarkSymbol : CutMarkSymbol with get, set
Property Value
CutMarkSymbol
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
CutMarkType Class
Autodesk.Revit.DB.Architecture Namespace